# Brewfile for macOS
# Installed automatically by quick-setup.sh

# ============================================================================
# Core Development Tools
# ============================================================================
brew "git"                      # Version control
brew "zsh"                      # Shell (macOS includes it, but this ensures latest)
brew "fzf"                      # Fuzzy finder
brew "ripgrep"                  # Fast grep alternative (rg)
brew "fd"                       # Fast find alternative
brew "jq"                       # JSON processor
brew "yq"                       # YAML processor
brew "wget"                     # File downloader
brew "curl"                     # Transfer data with URLs
brew "htop"                     # Interactive process viewer
brew "watch"                    # Execute program periodically
brew "tree"                     # Display directories as trees

# ============================================================================
# Editor & Terminal
# ============================================================================
brew "neovim"                   # Modern Vim
brew "tree-sitter-cli"          # Parser generator (needed for nvim treesitter parsers)
brew "tmux"                     # Terminal multiplexer
brew "oh-my-posh"               # Prompt theme engine
cask "wezterm"                  # Terminal emulator

# ============================================================================
# Build Tools
# ============================================================================
brew "cmake"                    # Cross-platform build system
brew "ninja"                    # Small build system
brew "gradle"

# ============================================================================
# Programming Languages & Runtimes
# ============================================================================
brew "node"                     # JavaScript runtime
brew "python@3.14"              # Python 3
brew "go"                       # Go programming language
brew "kotlin"

# ============================================================================
# Container Tools
# ============================================================================
brew "docker-compose"           # Multi-container Docker applications
cask "docker-desktop"           # Docker Desktop (includes daemon)

# ============================================================================
# GitHub & Git Tools
# ============================================================================
brew "gh"                       # GitHub CLI
brew "git-lfs"                  # Git Large File Storage

# ============================================================================
# macOS-Specific Applications
# ============================================================================
tap "nikitabobko/tap"
cask "nikitabobko/tap/aerospace" # Tiling window manager for macOS
tap "jetbrains/utils"
brew "jetbrains/utils/kotlin-lsp" # JetBrains Kotlin LSP (replaces deprecated kotlin-language-server)
cask "1password-cli"            # Password manager CLI

# ============================================================================
# Optional: GUI Applications
# ============================================================================
# Uncomment if desired:
# cask "raycast"                # Spotlight alternative
cask "mockoon"                  # Local API mock server (GUI)
